app/views/orders/show.html.erb

  <tbody>
    <% @order.cart.cart_items.each do |item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."deleted_at" IS NULL AND "cart_items"."cart_id" = $1  [["cart_id", 96]]
SELECT "carts".* FROM "carts" WHERE "carts"."deleted_at" IS NULL AND "carts"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]