app/controllers/carts_controller.rb

  def show
    @cart = find_or_create_cart
    @cart_items = @cart.cart_items.includes(:product)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 38]]

  def add_item
    cart = find_or_create_cart
    product = Product.find(params[:product_id])
    quantity = params[:quantity].to_i

    quantity = quantity > 0 ? quantity : 1

    cart_item = cart.cart_items.find_or_initialize_by(product: product)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 185], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", 38], ["product_id", 185], ["LIMIT", 1]]

  def remove_item
    @cart_item = CartItem.find(params[:format])
    @cart_item.destroy
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 29]]

  def find_or_create_cart
    cart = current_user.carts.where(status: 'active').last
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2 ORDER BY "carts"."id" DESC LIMIT $3  [["user_id", 4], ["status", "active"], ["LIMIT", 1]]