app/controllers/orders_controller.rb

  def show
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."deleted_at" IS NULL AND "orders"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]