app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL
---
    def index
      @products = Product.all

SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND "products"."id" = $1 LIMIT $2  [["id", 181], ["LIMIT", 1]]
---
    def show
      @product = Product.find(params[:id])